#include <iostream>
#include <locale.h>
#include <cmath>
using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    int h, m, s, p, q, r; //инициализация переменных часов, минут и секунд

    //задание времени
    cout << "Ведите значение часов: "; cin >> h;

    while (h < 0 || h > 23)
    {
        cout << "Введено некорректное значение часов. Введите число в промежутке от 0 до 23: "; cin >> h;
    }

    cout << "Ведите значение минут: "; cin >> m;

    while (m < 0 || m > 59)
    {
        cout << "Введено некорректное значение минут. Введите другое в промежутке от 0 до 59: "; cin >> m;
    }

    cout << "Ведите значение секунд: "; cin >> s;

    while (s < 0 || s > 59)
    {
        cout << "Введено некорректное значение секунд. Введите другое в промежутке от 0 до 59: "; cin >> s;
    }

    cout << "Ведите значение нужного промежутка часов: "; cin >> p;

    while (p < 0)
    {
        cout << "Введено некорректное значение промежутка часов. Введите неотрицательное число: "; cin >> p;
    }

    cout << "Ведите значение нужного промежутка минут: "; cin >> q;

    while (q < 0)
    {
        cout << "Введено некорректное значение промежутка минут. Введите неотрицательное число: "; cin >> q;
    }

    cout << "Ведите значение нужного промежутка секунд: "; cin >> r;

    while (r < 0)
    {
        cout << "Введено некорректное значение промежутка секунд. Введите неотрицательное число: "; cin >> r;
    }

    //перевод показаний электронных часов в число секунд
    int seconds1 = h * 3600 + m * 60 + s;

    //перевод нужного промежутка времени в число секунд
    int seconds2 = p * 3600 + q * 60 + r;

    int sum = seconds1 + seconds2;

    //время, отображаемое на электронных часах через p часов, q минут и r секунд
    int seconds = sum % 60;
    int minutes = ((sum - seconds) / 60) % 60;
    int hours = ((((sum - seconds) / 60) - minutes) / 60) % 24;

    //вывод
    cout << "Конечное время на часах: " << hours << ":";

    if (minutes < 10)
        cout << "0";

    cout << minutes << ":";

    if (seconds < 10)
        cout << "0";

    cout << seconds << endl;

    return 0;
}