#include <iostream>
#include <locale.h>
#include <cmath>
using namespace std;

static void task_2()
{
	double x, y; //инициализируем переменные координат
	bool in_square, in_circle, in_sector; //инициализируем переменные областей квадрата, круга и сектора

	//вводим значения координат
	cout << "Введите координату x нужной точки: "; cin >> x;
	cout << "Введите координату y нужной точки: "; cin >> y;

	//для удобства задаём переменную суммы квадратов x и y (x² + y²)
	double r_sqared = pow(x, 2) + pow(x, 2);

	//проверяем принадлежность точки к области:

	//задаём квадрат промежутками на координатной плоскости:
	//[-2, 6] по оси Ox   и   [-6, 2] по оси Oy
	in_square = x >= -2 && x <= 6 && y >= -6 && y <= 2;

	//задаём круг радиусом 2 и центром в центре координат:
	//x² + y² <= 2²
	in_circle = r_sqared <= 4;

	//задаём сектор круга с границами радиуса [4, 6] и центром круга в центре координат, расположенный в IV координатной четверти:
	//x² + y² >= 4²   и   x² + y² <= 6²   и   x > 0   и   y < 0
	in_sector = r_sqared >= 16 && r_sqared <= 36 && x > 0 && y < 0;

	//выводим вердикт проверки
	if (in_square && !in_circle && !in_sector)
		cout << "Точка входит в заштрихованную область" << endl;
	else
		cout << "Точка не входит в заштрихованную область" << endl;
}

static void task_6()
{
	double x, y; //инициализируем переменные координат
	bool in_triangle, in_rectangle1, in_rectangle2; //инициализируем переменные областей треугольника и двух прямоугольников

	//вводим значения координат
	cout << "Введите координату x нужной точки: "; cin >> x;
	cout << "Введите координату y нужной точки: "; cin >> y;

	//проверяем принадлежность точки к области:

	//задаём больший прямоугольник промежутками на координатной плоскости:
	//[-2, 2] по оси Ox   и   [0, 2] по оси Oy
	in_rectangle1 = x >= -2 && x <= 2 && y >= 0 && y <= 2;

	//задаём меньший прямоугольник промежутками на координатной плоскости:
	//[-1, 1] по оси Ox   и   [0, 1] по оси Oy
	in_rectangle2 = x >= -1 && x <= 1 && y >= 0 && y <= 1;

	//задаём треугольник с вершинами в точках (-1, 0), (0, -1) и (1, 0):
	//y >= −x − 1   и   y >= x − 1   и   y <= 0
	in_triangle = y >= -x - 1 && y >= x - 1 && y <= 0;

	//выводим вердикт проверки
	if ((in_rectangle1 && !in_rectangle2) || in_triangle)
		cout << "Точка входит в заштрихованную область" << endl;
	else
		cout << "Точка не входит в заштрихованную область" << endl;
}

int main()
{
	setlocale(LC_ALL, "ru_RU");

	task_2();
	//task_6();

	return 0;
}